tutorials/battery_samples/working-case1/0/Air/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/Air";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            zeroGradient;
        value           uniform 300;
    }
    outlet
    {
        type            zeroGradient;
        value           uniform 300;
    }
    walls
    {
        type            zeroGradient;
        value           uniform 300;
    }
    Air_to_battery1
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
    minX
    {
        type            fixedValue;
        value           uniform 300;
    }
    maxX
    {
        type            inletOutlet;
        inletValue      uniform 300;
    }
}


// ************************************************************************* //
